#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.github_repository.main-repo: Reading...
data.github_repository.main-repo: Read complete after 0s [id=Project-F]
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=e2584cbb-77a2-443d-b6c7-e3436ddf47eb-00685ac7-79c2-49be-91b5-9996f272ffab-4f2ea9b9-9fb0-4dd3-9011-de40855fb0f3]
azuread_application.ACR-application: Refreshing state... [id=5c0362d3-2156-4a73-9ce3-d385db6347a7]
azuread_application_password.ACR-application-password: Refreshing state... [id=5c0362d3-2156-4a73-9ce3-d385db6347a7/password/8d32db84-e838-4415-b6d0-b2f034325395]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.rg-projectf-dev-001: Refreshing state... [id=/subscriptions/039c5e5c-dcac-426f-9174-a04e1c39f8a3/resourceGroups/rg-projectf-dev-001]
data.azurerm_client_config.current: Read complete after 0s [id=2022-07-20 09:39:36.815471653 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.service-principal-password-github-secret will be created
  + resource "github_actions_secret" "service-principal-password-github-secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "Project-F"
      + secret_name     = "GithubActionsAcrAccessSecret"
      + updated_at      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @Retoxx-dev, Action: `pull_request`*